// This file is part of Server Extension.
// Server Extension - a mutator for Killing Floor 2.
//
// Copyright (C) 2016-2023 The Server Extension authors and contributors
//
// Server Extension is free software: you can redistribute it
// and/or modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation,
// either version 3 of the License, or (at your option) any later version.
//
// Server Extension is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
// See the GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License along
// with Server Extension. If not, see <https://www.gnu.org/licenses/>.

[ExtWeap_Pistol_9mm]
ItemName="9mm pistol"
ItemDescription="Just 9mm. Really just 9mm\nBut with infinite ammo. No reload. No mags. No defects. It's perfect."

[ExtWeap_Pistol_MedicS]
ItemName="Medic pistol"
ItemDescription="Just medic pistol. Really just medic pistol\nBut with infinite ammo. No reload. No mags. No defects. It's perfect.\nCan heal also. Useful."

[Ext_PerkBerserker]
PerkName="Berserker"

[Ext_PerkCommando]
PerkName="Commando"

[Ext_PerkDemolition]
PerkName="Demolitionist"

[Ext_PerkFieldMedic]
PerkName="Field Medic"

[Ext_PerkFirebug]
PerkName="Firebug"

[Ext_PerkGunslinger]
PerkName="Gunslinger"

[Ext_PerkSharpshooter]
PerkName="Sharpshooter"

[Ext_PerkSupport]
PerkName="Support"

[Ext_PerkSurvivalist]
PerkName="Survivalist"

[Ext_PerkSWAT]
PerkName="SWAT"

[Ext_T_MonsterPRI]
MonsterName="Petty"

[Ext_TGroupBase]
GroupInfo="Group"

[Ext_TGroupMonster]
GroupInfo="Monster"

[Ext_TGroupRegen]
GroupInfo="Regeneration"

[Ext_TGroupZEDTime]
GroupInfo="ZED Time"

[UIP_SpawnedPerkRebuild]
Caption="Perks"
Hint="Select and upgrade your perks"

[Ext_TraitAcidicCompound]
TraitName="Acidic Compound"
Description="When activated medic weapons have a chance to poison zeds."

[Ext_TraitAirborne]
TraitName="Airborne Agent"
Description="Give extra health boost and area of heal effect for medic darts during ZED-time,|each level gives extra amount of heal boost at a rate of:|Lv 1-3: +5%, +10%, +20%|Lv 4: +15%, but works outside of ZED-time too!"

[Ext_TraitAirborneAgent]
TraitName="ZED TIME - Airborne Agent"
Description="You release a healing gas during Zed time, healing teammates close by. ||-REQUIREMENT: Grenade Upgrade trait needs to be level 1!"

[Ext_TraitAmmoReg]
TraitName="Ammo Regeneration"
Description="With this trait all your weapons ammo (not grenades) will regen every half minute at rate of:|Lvl1-3: 2%, 5%, 10% of max ammo"

[Ext_TraitAPShots]
TraitName="Armor Piercing Rounds"
Description="Greatly increases penetration with perk weapons! The penetration strength is increased by every level in:|Lv1-4: 25%, 30%, 35%, 40%"

[Ext_TraitArmorReg]
TraitName="Armor Regeneration"
Description="With this trait your armor will regen every 10 seconds at a rate of:|Lvl1-3: +7pts, +12pts, +25pts"

[Ext_TraitArmorRep]
TraitName="Armor Repair"
Description="With this trait you will repair armor as you heal, for each level will repair armor with a rate of:|Lv1-5: +5%, +10%, +15%, +20%, +25%"

[Ext_TraitAutoFire]
TraitName="Auto-Fire weapons"
Description="Make all perked weapons fully automatic."

[Ext_TraitBoomWeld]
TraitName="Explosive Weld"
Description="Cases welded doors explode when broken by zeds. The more you weld one door, the bigger explosion."

[Ext_TraitBunnyHop]
TraitName="Bunny Hop"
Description="Enable player to do bunny hopping. It means the more you continiously make successful jumps while moving forward you will keep accelerating in speed."

[Ext_TraitCarryCap]
TraitName="Carry Capacity"
Description="With this trait you can carry more.|Lv1-5: +2,+4,+6,+8,+15 slots"

[Ext_TraitContactNade]
TraitName="Explode on Contact"
Description="Make dynamites explode on contact with the ZED."

[Ext_TraitDemoAOE]
TraitName="Area Of Damage"
Description="Increases the AOE of your demo weapons. The distance is increased by every level in:|Lv1-4: 15%, 20%, 25%, 30%"

[Ext_TraitDemoCriticalHit]
TraitName="Armor Piercing Rounds"
Description="Demo weapons will do 50% more damage when hitting a critical point!"

[Ext_TraitDemoDirectHit]
TraitName="High Impact"
Description="Demo weapons will do 25% more damage on a direct hit!"

[Ext_TraitDemoNuke]
TraitName="ZED Time - Nuke"
Description="Demo weapons will spawn a nuke during ZED time. |Each level increases the damage & time of the nuke field. ||-REQUIREMENT: Damage bonus trait needs to have at least 30 points!"

[Ext_TraitDemoProfessional]
TraitName="Demolitions Specialist"
Description="Projectiles from demo weapons will never be duds. ||-REQUIREMENT: Reload bonus trait needs to have at least 30 points!"

[Ext_TraitDemoReactiveArmor]
TraitName="Reactive Armor"
Description="When near death you will explode and leave yourself with 5 health"

[Ext_TraitDireReload]
TraitName="Dire reloader"
Description="This trait will make you reload much faster when you have less then 40 health."

[Ext_TraitDoorRepair]
TraitName="Door Repair"
Description="Allows you to repair doors using the welder."

[Ext_TraitDuracell]
TraitName="Duracell Batteries"
Description="With this trait your flashlight batteries becomes extra durable.|Lv1-4: +30,+100,+300,+1000% lifetime"

[Ext_TraitEliteReload]
TraitName="Tactical Reload"
Description="With this trait you will have extra speedy tactical reload moves for your perked weapons."

[Ext_TraitEnemyHP]
TraitName="Zed Scan"
Description="This trait lets you see enemy health bars. The distance is increased by every level in:|Lv1-4: 5m, 7m, 10m, 16m"

[Ext_TraitFanfire]
TraitName="ZED TIME - Fanfire"
Description="Make perked weapons fire at normal firerate during ZED-time."

[Ext_TraitFireExplode]
TraitName="Fire Explosion"
Description="Make zombies sometimes explode when burned to death."

[Ext_TraitFireRange]
TraitName="Extra Fire Range"
Description="Add some additional fire range to flamethrowers."

[Ext_TraitGhost]
TraitName="Redemption"
Description="With this trait you will turn into ghost when you die and redeem at another spot in the map.|Level 1: Works 50 % of the time, but never again until you respawned after death.|Level 2: Always works, and it lets you redeem again after 3 minutes"

[Ext_TraitGrenadeCap]
TraitName="Grenade Capacity"
Description="With this trait you can carry more grenades.|Lv1-5: +1,+2,+3,+5,+8 grenades"

[Ext_TraitGrenadeSUpg]
TraitName="Grenade Upgrade"
Description="With this upgrade you will upgrade to your perk specific grenades.|Level 1: SUPER grenade"

[Ext_TraitGrenadeUpg]
TraitName="Grenade Upgrade"
Description="With this upgrade you will upgrade to your perk specific grenades.|Level 1: Normal perk grenade|Level 2: Perk SUPER grenade (REQUIRES perk level 50 to buy)!"

[Ext_TraitHealthReg]
TraitName="Health Regeneration"
Description="With this trait your health will regen every 10 seconds at a rate of:|Lvl1-3: +5HP, +10HP, +20HP"

[Ext_TraitHeavyArmor]
TraitName="Heavy Armor"
Description="Makes your armor stop all damage (except for Siren scream and fall damage).|Level 2 makes you in addition spawn with 50 points of armor.|Level 3 makes you spawn with full armor."

[Ext_TraitKnockback]
TraitName="Knockback Resistance"
Description="Reduce the amount of knockback zeds do to you in a rate of:|Lvl1-4: -20%, -50%, -70%, -90%"

[Ext_TraitMachineGunner]
TraitName="ZED TIME - Machine Gunner"
Description="During Zed time, you do 3% more damage with perks weapons and shoot 3x faster with all guns!"

[Ext_TraitMedBoost]
TraitName="Adrenaline Shot"
Description="Healing players will increase there speed 10% up to 30%. The percent is increased by every level in:|Lv1-5: 10%, 15%, 20%, 25%, 30%"

[Ext_TraitMedDamBoost]
TraitName="Focus Injection"
Description="Healing players will increase there damage up to 15%. The percent is increased by every level in:|Lv1-3: 5%, 10%, 15%"

[Ext_TraitMedicPistol]
TraitName="Medic Pistol"
Description="Spawn with a medic pistol instead of standard 9mm."

[Ext_TraitMedShield]
TraitName="Coagulant Booster"
Description="Healing players will increase there damage resistance up to 30%. The percent is increased by every level in:|Lv1-5: 10%, 15%, 20%, 25%, 30%"

[Ext_TraitNapalm]
TraitName="Napalm"
Description="Make zombies lit each other on fire."

[Ext_TraitNightvision]
TraitName="Nightvision"
Description="Spawn with nightvision goggles."

[Ext_TraitPenetrator]
TraitName="ZED TIME - Penetrator"
Description="During Zed time, your perk weapons penetrate through any targets they hit! ||-REQUIREMENT: Armor Piercing Shots trait needs to be level 1!"

[Ext_TraitRackEmUp]
TraitName="Rack 'em up"
Description="Deals more damage to each consequtive headshot done to zeds by +7.5%.|For each level you can make a bigger combo and deal more damage in a rate of:|Lv1-5: +30%, +60%, +90%, +120%, +210%"

[Ext_TraitRagdoll]
TraitName="Knockout Resistance"
Description="Prevent you from being ragdolled. For each level you lower the chance of being knocked out by:|Lvl1-3: 20%, 50%, 80%"

[Ext_TraitRanger]
TraitName="ZED TIME - Ranger"
Description="This will make you effectively stun enemies with headshots during ZED-time."

[Ext_TraitRapidAssault]
TraitName="ZED TIME - Rapid Assault"
Description="Gives player unlimited ammunition for perked weapons during ZED-time and allows them to fire in realtime."

[Ext_TraitRetali]
TraitName="Retaliation"
Description="End your life with a BOOM!"

[Ext_TraitSirenResistance]
TraitName="Siren Resistance"
Description="Make all your projectiles resistant to siren screams."

[Ext_TraitSpartan]
TraitName="ZED TIME - Spartan!"
Description="This trait lets you move at normal speed and attack faster in ZED-time.|Lv1-3: +50,+120,+300% atk speed"

[Ext_TraitSupply]
TraitName="Ammunition Supply"
Description="With this trait you can supply ammunition for your team mates. For each use you will receive a little bit of XP points."

[Ext_TraitSupplyGren]
TraitName="Grenade Supply"
Description="With this trait you can supply grenades for your team mates. For each use you will receive a little bit of XP points."

[Ext_TraitSWATEnforcer]
TraitName="ZED TIME - SWAT Enforcer"
Description="This trait makes you move at normal speed and allows you to knock down zeds by bumping into them during ZED-time."

[Ext_TraitTacticalMove]
TraitName="Tactical Movement"
Description="This trait makes you move faster while in iron sight and crouched at a rate of:|Lv 1-3: +30%,+50%,+100%"

[Ext_TraitTactician]
TraitName="ZED TIME - Tactician"
Description="During Zed time, you reload perk weapons at full speed and switch perk weapons twice as fast! ||-REQUIREMENT: Damage bonus trait needs to have at least 30 points!"

[Ext_TraitToxicDart]
TraitName="Toxic Darts"
Description="Make your healing darts poison the ZEDs, the damage is increased in a rate of:|Lv 1-3: +15, +35, +70 dmg"

[Ext_TraitUberAmmo]
TraitName="ZED TIME - Uber Ammo"
Description="Gives player unlimited ammunition for perked weapons during ZED-time."

[Ext_TraitUnCloak]
TraitName="Cloak Detection"
Description="Detect cloaked stalkers with radius for each level:|Lv1-5: 3m, 5m, 7m, 10m, 15m"

[Ext_TraitUnGrab]
TraitName="Fake Out"
Description="With this trait you are ungrabbable by the zeds."

[Ext_TraitVampire]
TraitName="Vampire"
Description="With this trait you will recover some of your health by every kill (with a melee weapon), in a rate of:|Lv1-4: +2%, +3%, +4%, +6%"

[Ext_TraitWPBers]
TraitName="Berserker Weapon Loadout"
Description="This will grant you berserker weapon loadout to spawn with.|Level 1: Pulverizer|Level 2: Nailgun|Level 3: Sawblade Gun|Level 4: All 3"

[Ext_TraitWPComm]
TraitName="Commando Weapon Loadout"
Description="This will grant you commando weapon loadout to spawn with.|Level 1: Bullpup|Level 2: AK12|Level 3: SCAR|Level 4: All 3"

[Ext_TraitWPDemo]
TraitName="Demolitionist Weapon Loadout"
Description="This will grant you demolitionist weapon loadout to spawn with.|Level 1: C4|Level 2: M79 Grenade Launcher|Level 3: RPG Rocket Launcher|Level 4: All 3"

[Ext_TraitWPFire]
TraitName="Firebug Weapon Loadout"
Description="This will grant you firebug weapon loadout to spawn with.|Level 1: Dragons Breath|Level 2: Flamethrower|Level 3: Microwave Gun|Level 4: All 3"

[Ext_TraitWPGuns]
TraitName="Gunslinger Weapon Loadout"
Description="This will grant you gunslinger weapon loadout to spawn with.|Level 1: M1911 Pistol|Level 2: Desert Eagle|Level 3: Magnum Revolver|Level 4: All 3 with dualies"

[Ext_TraitWPMedic]
TraitName="Medic Weapon Loadout"
Description="This will grant you Field Medic weapon loadout to spawn with.|Level 1: SMG|Level 2: Shotgun|Level 3: Assault Rifle|Level 4: All 3"

[Ext_TraitWPSharp]
TraitName="Sharpshooter Weapon Loadout"
Description="This will grant you sharpshooter weapon loadout to spawn with.|Level 1: Crossbow|Level 2: M14 EBR|Level 3: Railgun|Level 4: All 3"

[Ext_TraitWPSupp]
TraitName="Support Weapon Loadout"
Description="This will grant you support weapon loadout to spawn with.|Level 1: M4 Shotgun|Level 2: Boomstick|Level 3: AA12|Level 4: All 3"

[Ext_TraitWPSurv]
TraitName="Survivalist Weapon Loadout"
Description="This will grant you Survivalist weapon loadout to spawn with.|Level 1: Dragons Breath|Level 2: M16M203 Assault Rifle|Level 3: Medic Assault Rifle|Level 4: All 3"

[Ext_TraitWPSWAT]
TraitName="SWAT Weapon Loadout"
Description="This will grant you SWAT weapon loadout to spawn with.|Level 1: MP5 RAS|Level 2: P90|Level 3: Kriss|Level 4: All 3"

[Ext_TraitZED_Damage]
TraitName="Zed Ferocity"
Description="This trait will scale how much damage your helper ZED will deal:|Lv1-5: +10%, +25%, +50%, +100%, +200%||-Requires Zed Handler trait."

[Ext_TraitZED_Health]
TraitName="Zed Vitality"
Description="This trait will scale how much health your helper ZED will have:|Lv1-5: +25%, +50%, +75%, +100%, +200%||-Requires Zed Handler trait."

[Ext_TraitZED_Summon]
TraitName="Zed Handler"
Description="With this trait you will spawn yourself a helper zed, the higher level of this trait you have, the better zed will spawn.||-REQUIREMENT: Damage bonus trait needs to have at least 30 points!"

[Ext_TraitZED_SummonExt]
TraitName="Zed Packmaster"
Description="With this trait you will spawn yourself extra helper zeds.|Lv 1: Spawn one extra weak zed.|Lv 2: Spawn one extra strong zed.|Lv 3: Spawn one weak and one strong zed.|Lv 4: Spawn two strong zeds.||-Requires Zed Handler trait."

[Ext_TraitZedative]
TraitName="ZED TIME - Zedative"
Description="During Zed time, damaging Zeds with perk weapons will slow them 30% and do massive amounts of poison damage. ||-REQUIREMENT: Healing bonus trait needs to have at least 25 points!"

[Ext_TraitZedTExt]
TraitName="Zedtime Extension"
Description="Adds ZED Time extensions to your perk. The amount of extensions is increased by 1 every level"

[KFExtendedHUD]
BadConnectionStr="Warning: Connection problem!"

[VS_ZedRecentZed]
ZombieName="Recently Infected"

[VSZombie]
ZombieName="Zombie"

[UIP_PerkSelection]
Caption="Perk"
Hint="Select and upgrade your perks"

[UIP_Settings]
Caption="Settings"
Hint="Show additional Zvampext settings"

[UIP_PlayerSpecs]
Caption="Stats"
Hint="Show all players server stats"

[UIP_AdminMenu]
Caption="Admin"
Hint="Server administration"

[UIP_About]
Caption="Help"
Hint="Zvampext commands and server help"

[UIP_MiniGame]
Caption="Minigame"
Hint="Play a minigame while at it"

[UIP_News]
Caption="News"
Hint="Server news page"

[UIP_PerkSelectionLobby]
Caption="Perk"
Hint="Select and upgrade your perks"

[xVotingReplication]
MaplistRecvMsg="Maplist successfully received."
ClientMapVoteMsg="MapVote:"
InitMapVoteMsg="Initializing mid-game mapvote..."
TwoMinRemainMsg="2 minutes remain..."
OneMinRemainMsg="1 minute remains..."
XSecondsRemainMsg="seconds..."
UnknownPlayerName="Someone"
VotedForKnownMapMsg="has voted for"
VotedForUnkownMapMsg="has voted for a map."
AdminForcedKnownMapswitchMsg="An admin has forced mapswitch to"
AdminForcedUnknownMapswitchMsg="An admin has forced a mapswitch."
KnownMapSwitchMsg="has won mapvote, switching map..."
UnknownMapSwitchMsg="A map has won mapvote, switching map..."

[UI_UnloadInfo]
ResetPerkNotice="NOTICE: Unload stats for"
PleaseWait="Please wait..."
ResetDisabledWarn="Perk unloading is disabled on this server!"
ResetMinLevelWarnPart1="You need to be at least on level #{FFFF00}"
ResetMinLevelWarnPart2="#{DEF} before you can use this feature!"
ResetAttentionPart1="#{FF0000}WARNING:#{DEF} By using this feature you will lose #{FFFF00}"
ResetAttentionPart2="#{DEF} XP points, and by that you will drop down #{FF0000}"
ResetAttentionPart3="#{DEF} levels!|In addition you will be forced to suicide to reset specific stats.||Are you sure you want to continue?"
ButtonNoText="No"
ButtonYesText="Yes"
ButtonNoToolTip="Abort without doing anything"
ButtonYesToolTip="Reset the perk (you can not undo this action!)"

[UI_MidGameMenu]
MapVoteButtonText="Map Vote"
MapVoteButtonToolTip="Show mapvote menu"
SettingsButtonText="Settings"
SettingsButtonToolTip="Enter the game settings"
SkipTraderButtonText="Skip Trader"
SkipTraderButtonToolTip="start voting for skip trader"
SpectateButtonText="Spectate"
SpectateButtonToolTip="Click to become a spectator"
CloseButtonText="Close"
CloseButtonToolTip="Close this menu"
DisconnectButtonText="Disconnect"
DisconnectButtonToolTip="Disconnect from this server"
ExitButtonText="Exit"
ExitButtonToolTip="Exit this game"
JoinButtonText="Join"
JoinButtonToolTip="Click to become an active player"

[UI_ResetWarning]
TitleText="WARNING: Reset"
YesButtonText="Yes"
YesButtonToolTip="Reset the perk (you can not undo this action!)"
NoButtonText="No"
NobuttonToolTip="Abort without doing anything"
InfoText="#{FF0000}WARNING:#{DEF} If you reset your perk to initial status, you can not undo this operation!|#{FF0000}All your gained XP and level (including prestige level) will be reset to 0.#{DEF}|Do NOT cry to an admin later if this was a mistake!||Are you sure you want to do this?"

[UIP_About]
MarcoText="Written by"
CreditsText="Credits"
ForrestMarkXText="Implementation of first person legs and backpack weapon."
SheepText="Beta testing."
InklesspenText="DLC weapons, XP for custom zeds and other features."
GenzmeyText="Localization, bugfixes and other features."
MysterialText="For ideas from UT2004RPG mod."
PostText="All other beta testers..."
AuthorButtonText="Author Profile"
AuthorButtonTooltip="Visit this mod authors steam profile"
ForumButtonText="Visit Forums"
ForumButtonTooltip="Visit this mods discussion forum"

[UIP_AdminMenu]
EditPlayer="EDIT:"
ShowDebugInfo="Show Debug Info"
Add1kXP="Add 1,000 XP"
Add10kXP="Add 10,000 XP"
AdvancePerkLevel="Advance Perk Level"
SetPerkLevel="Set Perk Level"
SetPrestigeLevel="Set Prestige Level"
UnloadAllStats="Unload all stats"
UnloadAllTraits="Unload all traits"
Remove1kXP="Remove 1,000 XP"
Remove10kXP="Remove 10,000 XP"
ResetAllStats="Reset ALL Stats"
ResetCurrentPerkStats="Reset Current Perk Stats"
ColumnPlayer="Player"
ColumnTotalKills="Total Kills"
ColumnTotalExp="Total EXP"
ColumnTotalPlayTime="Total PlayTime"
EditMotdButtonText="Edit MOTD"
EditMotdButtonToolTip="Edit the server Message of the Day"

[xUI_MapVote]
Title="MapVote menu"
CloseButtonText="Close"
CloseButtonToolTip="Close the mapvote menu."
ColumnMapName="Map Name"
ColumnSequence="Sequence"
ColumnPlayCount="Play Count"
ColumnRating="Rating"
ColumnGame="Game"
ColumnNumVotes="Num votes"
ColumnVoters="Voters"

[UIP_News]
WebSiteButtonText="Visit Website"
WebsiteButtonToolTip="Visit the server website at:"

[UIP_PerkSelection]
PrestigeButtonText="Prestige"
PrestigeButtonToolTip="Prestige this perk.|Minimum level required:"
PrestigeButtonDisabledToolTip="Prestige is disabled for this perk"
ResetButtonText="Reset Level"
ResetButtonToolTip="Reset this perk by unloading all stats, traits and set XP gained and level to 0"
UnloadButtonText="Unload Perk"
UnloadButtonToolTip="Reset all spent points on this perk and refund the points in exchange of some XP"
Level="Lv"
Points="Points:"
NoPerkSelected="<No perk selected>"
MaxStr="MAX"
NotAviable="N/A"

[UI_AdminMOTD]
WindowTitleText="Edit MOTD line"
YesButtonText="Submit"
YesButtonToolTip="Submit changes to server"
NoButtonText="Cancel"
NoButtonToolTip="Abort without doing anything"
EditBoxToolTip="Enter the text here, use vertical line character for line switches."
MotdPreviewText="MOTD Preview:"

[UI_PrestigeNote]
WindowTitleText="NOTICE: Prestige"
PrestigeButtonToolTip="Prestige the perk (you can not undo this action!)"
InfoLabelTextPart1="NOTICE: If you prestige your perk, you can not undo this operation!|All your gained XP and level will be reset to #{FF0000}0#{DEF}.|But this will also increase the amount of points by #{F7FE2E}+"
InfoLabelTextPart2="#{DEF} you earn for every level up in the future.||Are you sure you want to do this?"

[xUI_MapRank]
InfoText="Did you like this map?"
YesButtonText="Like"
YesButtonToolTip="Press this if you liked this map."
NoButtonText="Dislike"
NoButtonToolTip="Press this if you disliked this map."

[UIP_Settings]
FirstPersonLegsText="First person legs:"
FirstPersonLegsToolTip="Show first person body"
HideNameBeaconsText="Hide name beacons:"
HideNameBeaconsToolTip="Hide the player name beacons"
HideKillMessagesText="Hide kill messages:"
HideKillMessagesToolTip="Hide player kill messages"
HideDamageMessagesText="Hide damage messages:"
HideDamageMessagesToolTip="Hide player damage messages"
HideDamagePopupText="Hide damage popup:"
HideDamagePopupToolTip="Hide damage popup messages"
UseKf2DeathMessagesText="Use KF2 DeathMessages:"
UseKf2DeathMessagesToolTip="Use KF2 death message display format."
UseKf2KillMessagesText="Use KF2 Kill Messages:"
UseKf2KillMessagesToolTip="Use KF2 kill message display format."
DontBecomeZombieText="Don't become zombie:"
DontBecomeZombieToolTip="Disable zombie player mode (for game modes that support it)"
NoScreenShakeText="No screen shake:"
NoScreenShakeToolTip="Disable screen shake (from explosions)"
ButtonToggleBehindviewKeybindText="Toggle Behindview keybind:"
ButtonToggleBehindviewKeybindToolTip="With this desired button you can toggle your behindview (click to change it)"
ButtonPressButtonText="Press a button"
NotSetText="<Not set>"

[UIR_TraitInfoPopup]
ButtonBuyText="Buy"
ButtonBuyDisabledText="Max level"
ButtonBuyTooltip="Purchase this trait (you can not undo this action!)"
ButtonCancelText="Cancel"
ButtonCancelTooltip="Abort without doing anything"

[UI_AdminPerkLevel]
WindowTitleSetLevel="Set level"
WindowTitleSetPrestigeLevel="Set prestige level"
WindowTitleSetLevelOf="Set level of"
WindowTitleSetPrestigeLevelOf="Set prestige level of"
YesButtonText="Submit"
YesButtonToolTip="Set the perk/prestige level"
NoButtonText="Cancel"
NoButtonToolTip="Abort without doing anything"
LevelBoxToolTip="Enter the new perk/prestige level to set this player to."

[UIR_PerkTraitList]
TraitNameText="Trait name"
TraitLevelText="Level"
TraitCostText="Cost"

[UIR_PerkStat]
AddButtonToolTip="Click here to buy stats for this perk"
CountBoxToolTip="Here you can specify how many stat points to buy"
CostText="Cost"

[UIP_PlayerSpecs]
ShowStatsButtonText="Show Stats"
ShowStatsButtonToolTip="Show the stats of the current players in server"
TopPlaytimeButtonText="Top playtime"
TopPlaytimeButtonToolTip="Show the top playtime by players in all-time from this server"
TopKillsButtonText="Top kills"
TopKillsButtonToolTip="Show the top kills by players in all-time from this server"
TopExpButtonText="Top EXP"
TopExpButtonToolTip="Show the top EXP by players in all-time from this server"
PlayerColumnText="Player"
TotalKillsColumnText="Total Kills"
TotalExpColumnText="Total EXP"
TotalPlaytimeColumnText="Total PlayTime"

[UI_Scoreboard]
TimeText="Time"
PlayersText="Players"
PlayerText="Player"
AliveText="Alive"
SpectatorsText="Spectators"
HeaderWaveText="WAVE"
HeaderPlayerText="PLAYER"
HeaderDoshText="DOSH"
HeaderKillsText="KILLS"
HeaderAssistText="ASSISTS"
HeaderPingText="PING"
NoPerkText="No Perk"
RespawnText="Respawn"
BotText="BOT"
DeadText="DEAD"
UnmutePlayerText="Unmute player"
MutePlayerText="Mute player"
YouveMutedText="You've muted"
YouveUnmutedText="You've unmuted"
HealthText="Health"
RClickForOptsText="(Right click for options)"
SpecButtonText="Show Spectators"
SpecButtonTooltip="Toggle show server spectators"
SpectateThisPlayerText="Spectate this player"
ViewPlayerProfileText="View player Steam profile"
MuteText="Mute"

[UI_Scoreboard_CD]
HeaderPerkText="PERK"
HeaderStateText="STATE"
HeaderRankText="RANK"
DeveloperText="Developer"
VoteKickText="Vote kick player"

[Ext_PerkBase]
StatSpeed="Movement Speed (+&%)"
StatDamage="Perk Damage (+&%)"
StatRecoil="Fire Recoil Reduce (+&%)"
StatSpread="Fire Spread Reduce (+&%)"
StatRate="Perk Rate of Fire (+&%)"
StatReload="Perk Reload Time (-&%)"
StatHealth="Health (+&HP)"
StatKnockDown="Knockback (+&%)"
StatWelder="Welding Rate (+&%)"
StatHeal="Heal Efficiency (+&%)"
StatMag="Magazine Capacity (+&%)"
StatSpare="Max Ammo (+&%)"
StatOffDamage="Off-Perk Damage (+&%)"
StatSelfDamage="Self Damage Reduction (+&%)"
StatArmor="Armor (+&)"
StatPoisonDmg="Toxic Resistance (+&%)"
StatSonicDmg="Sonic Resistance (+&%)"
StatFireDmg="Fire Resistance (+&%)"
StatAllDmg="Zed Damage Reduction (+&%)"
StatHeadDamage="Perk Head Damage (+&%)"
StatHealRecharge="Syringe Recharge Rate (+&%)"
StatSwitch="Weapon Switch Speed (+&%)"

[ExtPerksContainer_Selection]
PerkChangeWarning="Perk changes will be applied when you die."

[ExtPlayerController]
GotItemText="got item:"
KilledHimselfWith="killed himself with"
WasBurnedToDeath="was burned to death"
WasBlownIntoPeaces="was blown into pieces"
HadSuddenHeartAttack="had a sudden heart attack"
WasKilledBy="was killed by"
WasIncineratedBy="was incinerated by"
WasBlownUpBy="was blown up by"
ConnectionError="Connection Error:"
Disconnecting="Disconnecting..."
NowViewingFrom="Now viewing from"
ViewingFromOwnCamera="Viewing from own camera."

[Ext_TGroupBase]
TraitGroupText="trait group"
MaxText="MAX"

[UIP_PerkSelectionLobby]
LevelText="Lv"
PointsText="Points:"
NoPerkSelectedText="<No perk selected>"

[MX_PongGame]
PressToStartText="Press Fire to start pong"
ScoreText="Score:"
PlaysText="Plays:"

[MS_PC]
ConnectingTo="Connecting to"
ConnectionAborted="Connection aborted"
UserAbortedConnection="User aborted connection..."
ConnectionError="Connection Error:"
Disconnecting="Disconnecting..."

[MS_HUD]
PressEscToCancel="Press [Esc] to cancel connection"
AdjustSensetive="Use Mouse scroll to adjust sensitivity:"

[KFExtendedHUD]
PleaseWaitForDownload="Downloading contents for next map, please wait..."
PressEscToCancel="Press [Escape] key to cancel connection!"
AreYouSureToCancel="Are you sure you want to cancel connection?"
PressEscToConfirm="Press [Escape] again to confirm..."
YouRespawnIn="You are about to respawn in"
ITR_CommonText="Common";
ITR_UncommonText="Uncommon +";
ITR_RareText="Rare ++";
ITR_LegendaryText="Legendary +++";
ITR_ExceedinglyRareText="Exceedingly Rare ++++";
ITR_MythicalText="Mythical !!!!";
ITR_DefaultText="Unknown -";
NewItemText="New Item:"
SomeoneText="Someone"
KillText="kill"
KillsText="kills"

[Ext_TraitBase]
MaxLevelText="Max level:"
LevelCostText="Level costs:"
MinPerkLevelText="Min perk level:"

[Ext_TGroupRegen]
GroupDescription="To buy additional regen abilities:|-Prestige level 1 = MAX 2 traits|-Prestige level 3 = MAX 3 traits"
MaxText="MAX"

[Ext_TraitAirborneAgent]
GroupDescription="Trait requires prestige level: #{FF4000}1"

[Ext_TraitDemoNuke]
GroupDescription="Trait requires prestige level: #{FF4000}3"

[Ext_TraitDemoProfessional]
GroupDescription="Trait requires prestige level: #{FF4000}1"

[Ext_TraitMachineGunner]
GroupDescription="Trait requires prestige level: #{FF4000}2"

[Ext_TraitPenetrator]
GroupDescription="Trait requires prestige level: #{FF4000}2"

[Ext_TraitTactician]
GroupDescription="Trait requires prestige level: #{FF4000}1"

[Ext_TraitWeapons]
GroupDescription="- Level 4 requires perk level 50 and level 3 carry capacity trait!"

[Ext_TraitZedative]
GroupDescription="Trait requires prestige level: #{FF4000}2"

[Ext_TraitZED_Summon]
GroupDescription="Level 6 requires prestige level:"

[Ext_TraitInferno]
TraitName="Inferno"
Description="During Zed time, your fire damage over time spreads to all surrounding Zeds/50% more damage and slowdown."

[Ext_TraitPyromaniac]
TraitName="Pyromaniac"
Description="During ZED Time, you attack with perk weapons in real time and never run out of ammo"

[Ext_TraitGroundFire]
TraitName="GroundFire"
Description="Ground fires deal 3x the damage and reduce Zed movement speed 30%."

[Ext_TraitHeatWave]
TraitName="HeatWave"
Description="ZED struck at point blank range with fire will stumble back."
[UIP_AdminPlayers]
Caption="Players"
Hint="Manage RPG player stats and admin actions"
EditPlayer="EDIT:"
ShowDebugInfo="Show Debug Info"
Add1kXP="Add 1,000 XP"
Add10kXP="Add 10,000 XP"
AdvancePerkLevel="Advance Perk Level"
SetPerkLevel="Set Perk Level"
SetPrestigeLevel="Set Prestige Level"
UnloadAllStats="Unload all stats"
UnloadAllTraits="Unload all traits"
Remove1kXP="Remove 1,000 XP"
Remove10kXP="Remove 10,000 XP"
ResetAllStats="Reset ALL Stats"
ResetCurrentPerkStats="Reset Current Perk Stats"
ColumnPlayer="Player"
ColumnTotalKills="Total Kills"
ColumnTotalExp="Total EXP"
ColumnTotalPlayTime="Total PlayTime"
EditMotdButtonText="Edit MOTD"
EditMotdButtonToolTip="Edit the server Message of the Day"

[UIP_AdminServer]
Caption="Server"
Hint="Server-level administration"
EditMotdButtonText="Edit MOTD"
EditMotdButtonToolTip="Edit the server Message of the Day"
SaveStatsButtonText="Save Stats"
SaveStatsButtonToolTip="Save every dirty RPG player stat file now"
ServerInfoText="Revamp admin tools for Endless RPG servers."

[UIP_AdminTraderGuard]
Caption="TraderGuard"
Hint="Endless trader-time guard controls"
EnableGuardText="Enable TraderGuard"
BlockSkipText="Block non-admin skip trader"
ForceSkipText="Fast Forward"
ForceSkipToolTip="Fast-forward trader time as an admin"
InfoText="TraderGuard keeps Endless trader time under admin control."





